Revit 2026 API

# IFCExtrusionCreationDataCustomAxis Property

---

The custom extrusion axis to try when generating an extrusion.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ CustomAxis { get; set; }
```
```vb
Public Property CustomAxis As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ CustomAxis {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member CustomAxis : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace